init.org
#+TODO: TODO(t) | DONE(o)
#+HUGO_BASE_DIR: ./hugo/
#+HUGO_SECTION: ./
#+title: 麦汁三昧
#+author: mugijiru
#+chapter: true
#+toc: headlines 2
#+HUGO_LEVEL_OFFSET: 1

* Top
  :PROPERTIES:
  :END:

** 麦汁's Emacs Config
   :PROPERTIES:
   :EXPORT_FILE_NAME: _index
   :END:

   ここは @mugijiru の Emacs の設定ファイルの一部を解説しているページです。

   https://github.com/mugijiru/.emacs.d/blob/master/init.org から
   ox-hugo を使ってWebサイトに仕立て上げています。

*** 動作確認環境

    以下の環境で使用しています。が、動作を保証するものではありません。

    - macOS :: [[https://github.com/railwaycat/homebrew-emacsmacport][emacsmacport]] で用意されている Emacs
    - Ubuntu 20.04 LTS :: apt で手に入る Emacs 26.3

*** 注意点

    まだ全ての設定を init.org に記載できていない上に
    init.org からの出力設定も済ませていないので
    極一部の設定ファイルのみの解説となります。

* 基本設定
  :PROPERTIES:
  :EXPORT_HUGO_SECTION: basics
  :END:

** 基本設定
   :PROPERTIES:
   :EXPORT_FILE_NAME: _index
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :pre "<b>1. </b>" :weight 1 :disableToc true
   :END:
   #+TOC: nil
   #+OPTIONS: toc:nil

   Emacs の基本動作に関わる部分をここでは設定している

   - [[*exec-path][exec-path]] :: PATH などの環境変数を shell と合わせる設定
   - [[*auto-save][auto-save]] :: 編集中状態の自動保存や編集前の状態のバックアップに関する設定
   - [[*load-path][load-path]] :: Emacs Lisp が読み込める path の設定
   - [[*savehist][savehist]] :: ミニバッファの履歴などを保存してくれる機能。
   - [[*ガベージコレクション][ガベージコレクション]] :: メモリの開放関係の設定

** auto-save                                                    :replacement:
   :PROPERTIES:
   :EXPORT_FILE_NAME: auto-save
   :END:

*** 概要

    編集中状態の自動保存や、編集前や保存直後の状態のバックアップに関する設定をここでは書いている。

    Emacs ではデフォルトでも
    編集中ファイルの自動保存や、編集前の状態の自動バックアップもしてくれるが
    開いているファイルとは違う場所に保存したりすることで、より便利になるのでいくつかの設定を入れている。

*** 設定

**** 自動保存設定

     デフォルトだと ~#hoge.txt#~ みたいなファイル名で作られる、自動保存に関する設定。

     まあこの自動保存されてやつを活用できてる気がしないのでこの自動保存自体不要な気はしているが、
     とりあえず場所を移動して邪魔にはならないようにはしている。

***** 自動保存のタイミング

      自動保存のタイミングは

      - auto-save-timeout
      - auto-save-interval

      で制御されている。

      まず auto-save-timeout で設定した秒数が経過すると再度自動保存が実行される。

      これがデフォルトだと 30 秒なのだが、ちょっと長いのでその半分の 15 秒で保存されるように設定を変更している。

      #+begin_src emacs-lisp :tangle inits/10-auto-save.el
      (setq auto-save-timeout 15)
      #+end_src

      また auto-save-interval で設定した回数のキーイベントが発生すると再度自動保存を実行する。

      これもデフォルトだと 300 と結構なキーを叩く必要があるので 60 回としている。

      #+begin_src emacs-lisp :tangle inits/10-auto-save.el
      (setq auto-save-interval 60)
      #+end_src

***** 自動保存先を変更する

      自動保存はそのままだと弄ってるファイルの場所に作られる。
      が、これは以下のようにすると ~~/.emacs.d/backup/~ 一応変更可能。

      #+begin_src emacs-lisp :tangle inits/10-auto-save.el
      (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/backup/" t)))
      #+end_src

      ただ、デフォルト値が

      #+begin_src emacs-lisp
      (("\\`/[^/]*:\\([^/]*/\\)*\\([^/]*\\)\\'" "/tmp/\\2" t))
      #+end_src

      なので ~.*~ にしているのは乱暴そうな気がしている。

      というわけで
      https://masutaka.net/chalow/2014-05-11-1.html
      に書かれているのを真似して

      #+begin_src emacs-lisp
      (("~/\\([^/]*/\\)*\\([^/]*\\)$" "~/.emacs.d/backup/\\2" t))
      #+end_src

      とでもした方が良いかもしれない。

**** バックアップファイル

     自動保存とは別に、
     ファイルを開いた時点のバージョンや保存した時点のバージョンを取っておいてくれる自動バックアップ機能もあるので
     その設定も弄っている。

***** バックアップ先のフォルダ指定

      デフォルトでは編集しているファイルと同じフォルダにバックアップファイルを作成するようになっている。

      だけど、こいつが結構邪魔なので
      バックアップファイルは ~~/.emacs.d/backup/~ に全部保存するようにしている。

      また、普段 tramp は使っていないが
      何かの拍子で使った時にバックアップが取られると邪魔そうなのでそれは保存しないようにしている。

      #+begin_src emacs-lisp :tangle inits/10-auto-save.el
      (setq backup-directory-alist '((".*" . "~/.emacs.d/backup")
                                     (,tramp-file-name-regexp . nil)))
      #+end_src

***** バージョン管理

      バックアップにはバージョン管理機能もある。が、標準では無効化されている。

      とりあえず古いバージョンを引っ張り出せると便利かもと思って有効化している。

      #+begin_src emacs-lisp :tangle inits/10-auto-save.el
      (setq version-control t)
      #+end_src

      が、実際それを使ったことはない。。。

      また、古過ぎるバックアップファイルは要らないので、
      自動的に消されるように設定している。

      #+begin_src emacs-lisp :tangle inits/10-auto-save.el
      (setq delete-old-versions t)
      #+end_src

**** その他

     Emacs の自動保存などについては
     http://yohshiy.blog.fc2.com/blog-entry-319.html
     によくまとめられているので、いずれその内容を設定に反映させたい。

     また [[https://github.com/bbatsov/super-save][super-save]] というやつを使って実ファイルに自動保存したりしたらこれも不要になると思われる。

** exec-path
   :PROPERTIES:
   :EXPORT_FILE_NAME: exec-path
   :END:

*** 概要
    Emacs は通常最小限の環境変数しか利用しないようになっている。

    が、それだと普段使う上で「ああ、このコマンドが使えなくてもどかしい……!」
    と感じてしまう。

    そこで [[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]] というのを使って
    Emacs が見える PATH 環境変数をシェルが見てる PATH 環境変数と揃うようにしている。

*** インストール

    いつも通り el-get からインストールしている

    #+begin_src emacs-lisp :tangle inits/00-exec-path.el
    (el-get-bundle exec-path-from-shell)
    #+end_src

*** 有効化                                                      :improvement:

    理由は忘れたが Mac の環境でのみ有効化している。
    その内 Linux 環境でも有効化を試みた方が良さそう

    #+begin_src emacs-lisp :tangle inits/00-exec-path.el
    (when (memq window-system '(mac ns))
      (exec-path-from-shell-initialize))
    #+end_src

    なお、これでシェルと共通の環境変数が使われるようになるのは
    [[https://github.com/purcell/exec-path-from-shell/blob/bf4bdc8b8911e7a2c04e624b9a343164c3878282/exec-path-from-shell.el#L85-L89][デフォルトでは ~PATH~ と ~MANPATH~ のみである]]

*** その他

    なぜか以下のようなコメントを書いていた。
    普段使っている zsh で持ってる PATH は使わないのだろうか? :thinking_face:

    #+begin_src emacs-lisp
    ;; for exec path
    ;; use .bashrc setted path
    #+end_src

** load-path
   :PROPERTIES:
   :EXPORT_FILE_NAME: load-path
   :END:

*** 概要

    ~load-path~ は Emacs の設定でも重要な項目で
    このリストに追加されている path は ~load~ または ~require~ する際に走査される path となっている。

    即ち load-path を通しておけば、そこに置いている emacs lisp のファイルは簡単に読み出せるようになる。

    なお package-install や el-get を使っておけば基本的に自分で load-path を通す必要はない。

*** 秘匿情報を入れてるフォルダを読み込み可能にする

    パスワードなどの秘匿情報を持っている部分は ~~/.emacs.d/secret~ というフォルダで管理している。
    そのためここに入ってる emacs lisp のファイルも読み込めるように load-path に追加している。

    #+begin_src emacs-lisp :tangle inits/00-load-path.el
    (add-to-list 'load-path (expand-file-name "~/.emacs.d/secret"))
    #+end_src

*** my/load-config                                              :replacement:

    ~~/.emacs.d/secret~ は個人マシンか会社マシンかによって置いてるデータが異なったりするため
    もしもファイルがなくてもエラーにならないような方法で load する方法が必要だった。

    というわけでファイルがなかったら読み込まずにメッセージを出力して終了するような関数を用意している。

    #+begin_src emacs-lisp :tangle inits/00-load-path.el
    (defun my/load-config (file)
      (condition-case nil
          (load file)
        (file-missing (message "Load error: %s" file))))
    #+end_src

    ただ、これって結局

    #+begin_src emacs-lisp
    (load file nil t)
    #+end_src

    で十分な気もするので、置き換えを検討した方が良さそう。

** savehist
   :PROPERTIES:
   :EXPORT_FILE_NAME: savehist
   :END:

*** 概要

    Emacs 標準でついている、ミニバッファの履歴などを保存してくれる機能。

*** 有効化

    標準でついているので以下のようにするだけで有効化可能。

    #+begin_src emacs-lisp :tangle inits/00-savehist.el
    (savehist-mode 1)
    #+end_src

*** 設定                                                        :improvement:

    標準で保存されるもの以外だと kill-ring だけを保存対象にしている。
    これで Emacs を終了させても kill-ring は残るようになるはず。
    だけど最近使えてない気がするな……。検証が必要そう。

    #+begin_src emacs-lisp :tangle inits/00-savehist.el
    (setq savehist-additional-variables '(kill-ring))
    #+end_src

    他にも有効にしたら便利そうなのがあれば追加したい。
    が、ぱっとは思い付かない。

** ガベージコレクション
   :PROPERTIES:
   :EXPORT_FILE_NAME: gcmh
   :END:

*** 概要
    ガベージコレクションには gcmh というのを利用してみている。

    https://github.com/emacsmirror/gcmh

    普段は GC を控えめにしながら
    操作してない間に GC が走るような作りになっている。便利そう。

*** インストール
    #+begin_src emacs-lisp :tangle inits/00-gc.el
    (el-get-bundle gcmh)
    #+end_src

    これだけで有効化もされる。

*** その他

    以前の設定も折り畳んで残しておく

    #+begin_details
    #+begin_summary
    使わなくなったコード
    #+end_summary
    gcmh を入れる前に設定していたコード。
    gcmh を入れたらこれよりもいい感じに対応してくれそうなので入れ替えた。

    #+begin_src emacs-lisp
    ;; https://gist.github.com/garaemon/8851900ef27d8cb28200ac8d92ebacdf
    ;; Increase threshold to fire garbage collection
    (setq gc-cons-threshold 1073741824)
    (setq garbage-collection-messages t)

    ;; Run GC every 60 seconds if emacs is idle.
    (run-with-idle-timer 60.0 t #'garbage-collect)
    #+end_src
    #+end_details

* キーバインド
   :PROPERTIES:
   :EXPORT_HUGO_SECTION: keybinds
   :END:
** キーバインド
   :PROPERTIES:
   :EXPORT_FILE_NAME: _index
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :pre "<b>2. </b>" :weight 2 :disableToc true
   :END:

   ここでは全体に関わるキーバインド系の設定を記載している。

   - [[*sticky-control][sticky-control]] :: Control の入力を sticky にしてくれるやつ

** sticky-control
   :PROPERTIES:
   :EXPORT_FILE_NAME: sticky-control
   :END:

*** 概要
    指定したキーを2回叩いたら
    Control が押されてるような状態にしてくれるプラグイン。

    その2回の間隔はデフォルトだと 0.5 秒以内となっている。
    そのため、そのキーを押して 0.5 秒が経過したら、普通にそのキーが押されたことになる

    さらに ~sticky-control-shortcuts~ に指定されてる一部のキーについては
    sticky 用のキーを押した直後に shortcuts のキーを押すと
    Control を押している状態でそのキーを押したことになる。

    例えば私は ~,~ を sticky 用のキーにしていて
    shortcuts に ~c~ を入れているので
    ~,c~ と素早くタイプをすればそれだけで ~C-c~ が押された状態になる。

*** インストール

    まずは el-get-bundle でインストール。

    #+begin_src emacs-lisp :tangle inits/80-sticky-control.el
    (el-get-bundle sticky-control)
    #+end_src

    ちなみにレシピは公式ではなかったので
    とりあえず自分の環境で使えるように自作レシピを置いている。

    #+begin_src emacs-lisp :tangle recipes/sticky-control.rcp
    (:name sticky-control
           :description "save your left little finger"
           :type http
           :url "https://raw.githubusercontent.com/martialboniou/emacs-revival/master/sticky-control.el"
           :features "sticky-control")
    #+end_src

    元々は http://www.cs.toronto.edu/~ryanjohn/sticky-control.el にあったのだけど
    最近そこからは取得できなくなったので
    https://github.com/martialboniou/emacs-revival/blob/master/sticky-control.el
    から取得して利用している

*** 設定

    まずは「2回叩いたら Control を押している状態になる」キーを指定する。

    #+begin_src emacs-lisp :tangle inits/80-sticky-control.el
    (sticky-control-set-key 'sticky-control-key ?,)
    #+end_src

    私は ~,~ を sticky-control のキーにしているのでこの指定。

    そして次に ~sticky-control-shortuts~ の指定。
    ここに指定しておくと、
    例えば ~,c~ と素早くタイプすることで ~C-c~ が入力された状態とすることができる。

    #+begin_src emacs-lisp :tangle inits/80-sticky-control.el
    (setq sticky-control-shortcuts
          '((?c . "\C-c")
            (?g . "\C-g")
            (?k . "\C-k")
            (?a . "\C-a")
            (?e . "\C-e")
            (?n . "\C-n")
            (?o . "\C-o")
            (?p . "\C-p")
            (?j . "\C-j")
            (?f . "\C-f")
            (?b . "\C-b")
            (?x . "\C-x")
            (?r . "\C-r")
            (?s . "\C-s")))
    #+end_src

    結構な数を指定しているけど、普段そんなに使えているわけでもない。
    まあ、大体 Control を押しながら使いそうなところは押さえてあるので
    何も考えずとも使えるようにしてある。

*** 有効化
    最後に有効化

    #+begin_src emacs-lisp :tangle inits/80-sticky-control.el
    (sticky-control-mode)
    #+end_src

* ファイル編集
  :PROPERTIES:
  :EXPORT_HUGO_SECTION: editing
  :END:

** ファイル編集
   :PROPERTIES:
   :EXPORT_FILE_NAME: _index
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :pre "<b>3. </b>" :weight 3 :disableToc true
   :END:

   ここにはファイル編集系の設定をまとめている

   - [[*auto-insert][auto-insert]] :: ファイル新規作成時にテンプレートを挿入する機能

** auto-insert
   :PROPERTIES:
   :EXPORT_FILE_NAME: auto-insert
   :END:

*** 概要
    auto-insert はファイルを新規作成した時に
    ファイル名に応じたテンプレートを挿入する機能。

    Emacs が標準で持ってるライブラリなのでインストールは不要

*** 設定

    Emacs の設定は .emacs.d の中に閉じ込めたいので
    auto-insert のテンプレートも ~~/.emacs.d/insert~ に閉じ込める設定にしている。

    #+begin_src emacs-lisp :tangle inits/20-auto-insert.el
    (custom-set-variables '(auto-insert-directory "~/.emacs.d/insert/"))
    #+end_src

*** 有効化

    あとは単に有効化している。

    #+begin_src emacs-lisp :tangle inits/20-auto-insert.el
    (auto-insert-mode 1)
    #+end_src

*** 他の設定

    ファイル名を正規表現でマッチさせてテンプレートが選択されるので
    各言語やフレームワーク毎に設定を入れることにしている。

    実際は今のところ inits/41-vue.el でのみ追加設定を入れている。

* UI
  :PROPERTIES:
  :EXPORT_HUGO_SECTION: ui
  :END:
** UI
   :PROPERTIES:
   :EXPORT_FILE_NAME: _index
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :pre "<b>4. </b>" :weight 4 :disableToc true
   :END:

   ここでは Emacs の UI を変更するようなものを載せている

   - [[*all-the-icons][all-the-icons]] :: Emacs で様々なアイコンを表示できるようにするやつ
   - [[*helm][helm]] :: 絞り込みインターフェースを提供するやつ
   - [[*helm-posframe][helm-posframe]] :: Helm を posframe で使えるようにするやつ
   - [[*highlight-indent-guides][highlight-indent-guides]] :: インデント毎にラインを引いたりして見易くしてくれるやつ
   - [[*Neotree][Neotree]] :: フォルダ構造を IDE みたいにツリー表示するやつ
   - [[*toolbar][toolbar]] :: Emacs 標準のボタンなどの UI 部分の設定
   - [[*uniquify][uniquify]] :: 同名ファイルを開いている時にどこのファイルかまで表示してくれるやつ
   - [[*zoom][zoom]] :: フォーカスが当たってるウインドウを大きく表示してくれるやつ

** all-the-icons
   :PROPERTIES:
   :EXPORT_FILE_NAME: all-the-icons
   :END:

*** 概要

    [[https://github.com/domtronn/all-the-icons.el][all-the-icons]] は Emacs で様々なアイコンを表示できるようにして華やかにしてくれるパッケージです。
    [[*Neotree][Neotree]] などでも対応していてアイコンでファイルの種類が表示されるようになってモダンな雰囲気が出ます。

*** インストール                                                :improvement:

    いつも通り el-get-bundle で入れている。
    明示的に require している理由は忘れました。

    #+begin_src emacs-lisp :tangle inits/20-all-the-icons.el
    (el-get-bundle all-the-icons)
    (require 'all-the-icons)
    #+end_src

*** フォントのインストール

    以下のコマンドを叩くことでフォントをインストールすることができる。
    all-the-icons のインストール直後に叩いておいたら普段は叩かなくて良いはず。

    #+begin_src emacs-lisp
    (all-the-icons-install-fonts)
    #+end_src

    all-the-icons の更新後は叩いた方がいいかもしれない

*** キーバインド                                                :improvement:

    キーバインドは覚えられないし、使えるキーも大分埋まってるので、
    pretty-hydra を使って all-the-icons 用の Hydra を用意している。

    #+begin_src emacs-lisp :tangle inits/20-all-the-icons.el
    (with-eval-after-load 'pretty-hydra
      (pretty-hydra-define all-the-icons-hydra (:separator "-" :title "All the icons" :exit t :quit-key "q")
        ("Insert"
         (("a" all-the-icons-insert-alltheicon "All the icons")
          ("f" all-the-icons-insert-fileicon   "File icons")
          ("F" all-the-icons-insert-faicons    "FontAwesome")
          ("m" all-the-icons-insert-material   "Material")
          ("o" all-the-icons-insert-octicon    "Octicon")
          ("w" all-the-icons-insert-wicon      "Weather")
          ("*" all-the-icons-insert            "All")))))
    #+end_src

    |-----+----------------------------------------------------|
    | Key | 効果                                               |
    |-----+----------------------------------------------------|
    | a   | all-the-icons で追加されてるアイコンを検索して挿入 |
    | f   | ファイルアイコンを検索して挿入                     |
    | F   | FontAwesome アイコンを検索して挿入                 |
    | m   | Material アイコンを検索して挿入                    |
    | o   | Octicon のアイコンを検索して挿入                   |
    | w   | 天気アイコンを検索して挿入                         |
    | *   | 全てのアイコンを検索して挿入                       |
    |-----+----------------------------------------------------|

    フォントのインストールコマンドもここに収めてしまうのが良さそうな気がする

** highlight-indent-guides
   :PROPERTIES:
   :EXPORT_FILE_NAME: highlight-indent-guides
   :END:

*** 概要

    [[https://github.com/DarthFennec/highlight-indent-guides][highlight-indent-guides]] はインデント毎にラインを引いたりして見易くしてくれるパッケージ。
    通常のプログラムを書く時にも便利だけど、
    YAML などのインデントがそのまま構造になるような言語を弄る時にとても便利。

*** インストール

    これもいつも通り el-get でインストールしている。
    また GitHub にあるので、そこから直接インストールしている。

    #+begin_src emacs-lisp :tangle inits/30-highlight-indent-guides.el
    (el-get-bundle DarthFennec/highlight-indent-guides)
    #+end_src

*** 設定                                                        :improvement:

    今いる行がどのインデントにいるのかをわかりやすくするために
    responsive モードを有効にしている。

    #+begin_src emacs-lisp :tangle inits/30-highlight-indent-guides.el
    (setq highlight-indent-guides-responsive "stack")
    #+end_src

    defcustom で定義されてる変数なので
    custom-set-variables で設定した方がいいかもしれない。

** helm
   :PROPERTIES:
   :EXPORT_FILE_NAME: helm
   :END:

*** 概要

    [[https://github.com/emacs-helm/helm][helm]] は anything.el の後継であり、
    インクリメンタルに候補の絞り込みをしたりする UI を提供する便利なパッケージ。

    [[https://github.com/peco/peco][peco]] とか [[https://github.com/junegunn/fzf][fzf]] とかと似ているっちゃ似ているかな? fzf 使ったことないけど。

    一時期開発が止まってるようだったけど最近(2021年)はまた更新が活発になっている。

    ただ、麦汁さんは ivy に乗り換えようとしているので helm の設定は頑張っていない。
    helm-for-files が便利なのでまだ捨てられてないけど……。

