init.org
** 61-org-capture.el

   #+begin_src emacs-lisp :tangle inits/61-org-capture.el
   ;; org-capture
   (defvar org-capture-ical-file (concat org-directory "ical.org"))
   (setq org-capture-ical-file (concat org-directory "ical.org"))

   (setq my/org-capture-interrupted-file  (concat my/org-tasks-directory "interrupted.org"))
   (setq my/org-capture-inbox-file        (concat my/org-tasks-directory "inbox.org"))
   (setq my/org-capture-pointers-file     (concat my/org-tasks-directory "pointers.org"))
   (setq my/org-capture-impediments-file  (concat org-directory "work/scrum/impediments.org"))
   (setq my/org-capture-memo-file         (concat org-directory "memo.org"))
   (setq my/org-capture-sql-file          (concat org-directory "work/sql.org"))
   (setq my/org-capture-shopping-file     (concat my/org-tasks-directory "shopping.org"))
   (setq my/org-capture-2020-summary-file (concat org-directory "private/2020_summary.org"))

   (setq org-capture-templates
         `(("g" "Inbox にエントリー" entry
            (file ,my/org-capture-inbox-file)
            "* TODO %?\n\t")
           ("m" "Memoにエントリー" entry
            (file+headline ,my/org-capture-memo-file "未分類")
            "*** %?\n\t")
           ("p" "Pointersにエントリー" entry
            (file+headline ,my/org-capture-pointers-file "Pointers")
            "** %?\n\t")
           ("i" "割り込みタスクにエントリー" entry ;; 参考: http://grugrut.hatenablog.jp/entry/2016/03/13/085417
            (file+headline ,my/org-capture-interrupted-file "Interrupted")
            "** %?\n\t" :clock-in t :clock-resume t)
           ("I" "障害リストにエントリー" entry
            (file+headline ,my/org-capture-impediments-file "Impediments")
            "** TODO %?\n\t")
           ("R" "2020ふりかえりにエントリー" entry
            (file+headline ,my/org-capture-2020-summary-file "Timeline")
            "** %?\n\t")
           ("s" "SQL にエントリー" entry
            (file+headline ,my/org-capture-sql-file "SQL")
            "** %?\n\t")
           ("S" "買い物リストエントリー" entry
            (file ,my/org-capture-shopping-file)
            "* TODO %?\n\t")
           ("b" "Blogネタにエントリー" entry
            (file+headline ,my/org-capture-memo-file "Blogネタ")
            "** %?\n\t")
           ("P" "Protocol" entry
            (file+headline ,my/org-capture-pointers-file "Pointers")
            "** %?\n   #+BEGIN_QUOTE\n   %i\n   #+END_QUOTE\n\n   Source: %u, [[%:link][%:description]]\n")
           ("L" "Protocol Link" entry
            (file+headline ,my/org-capture-pointers-file "Pointers")
            "** %:description\n   %:link\n   %?\n   Captured On: %U")
           ("c" "同期カレンダーにエントリー" entry
            (file+headline ,org-capture-ical-file "Schedule")
            "** TODO %?\n\t")))
   #+end_src

** 61-org-clock.el

   #+begin_src emacs-lisp :tangle inits/61-org-clock.el
   (setq org-clock-clocktable-default-properties
         '(:maxlevel 10
                    :lang "ja"
                    :scope agenda-with-archives
                    :block today
                    :level 4))

   (defun my/org-clock-in-hook ()
     (let* ((task org-clock-current-task)
            (message (format "開始: %s" task)))
       (my/notify-slack-times message))

     (if (org-clocking-p)
         (org-todo "DOING")))

   (defun my/org-clock-out-hook ()
     (let* ((task org-clock-current-task)
            (message (format "終了: %s" task)))
       (my/notify-slack-times message)))

   (setq org-clock-in-hook 'my/org-clock-in-hook)
   (setq org-clock-out-hook 'my/org-clock-out-hook)

   ;; org-pomodoro

   (el-get-bundle org-pomodoro)
   (setq org-pomodoro-play-sounds nil)
   #+end_src

** 61-org-export.el

   #+begin_src emacs-lisp :tangle inits/61-org-export.el
   ;; フッターなくしたり
   (setq org-export-html-footnotes-section "")
   (setq org-export-html-footnote-format "")
   (setq org-export-with-footnotes nil)
   (setq org-export-with-creator nil)
   (setq org-export-with-author nil)
   (setq org-html-validation-link nil)

   ;; for seesaa blog settings
   (setq org-export-author-info nil)
   (setq org-export-email-info nil)
   (setq org-export-creator-info nil)
   (setq org-export-time-stamp-file nil)
   (setq org-export-with-timestamps nil)
   (setq org-export-with-section-numbers nil)
   (setq org-export-with-sub-superscripts nil)

   ;;; Table of Contents を出さない
   (setq org-export-with-toc nil)

   ;;; h1でサイト名出さない
   (setq org-export-html-preamble nil)
   (setq org-html-preamble nil)

   ;;; *bold* とか /italic/ とか _underline_ とかを<b>とかにしないようにする
   (setq org-export-with-emphasize nil)

   ;; デフォは日本語設定
   (setq org-export-default-language "ja")
   #+end_src

** 61-org-gcal.el                                               :replacement:

   gcal に乗り換えようかと思ってる

   #+begin_src emacs-lisp :tangle inits/61-org-gcal.el
   (el-get-bundle persist) ;; org-gcal に必要
   (el-get-bundle org-gcal)
   (require 'org-gcal)
   (my/load-config "my-org-gcal-config")
   #+end_src

** 61-org-ql.el

   #+begin_src emacs-lisp :tangle inits/61-org-ql.el
   (el-get-bundle org-ql)
   #+end_src

** 61-org-refile.el

   #+begin_src emacs-lisp :tangle inits/61-org-refile.el
   (setq org-refile-use-outline-path 'file)
   (setq org-outline-path-complete-in-steps nil)
   (setq org-refile-targets `((,(concat org-directory "tasks/projects.org") :level . 2)
                              (,(concat org-directory "tasks/pointers.org") :level . 1)
                              (,(concat org-directory "work/scrum/impediments.org") :level . 3)
                              (,(concat org-directory "tasks/next-actions.org") :regexp . "today")
                              (,(concat org-directory "tasks/next-actions.org") :regexp . "C-")
                              (,(concat org-directory "private/2020_summary.org") :level . 2)
                              (,(concat org-directory "tasks/shopping.org") :level . 1)
                              (,(concat org-directory "tasks/someday.org") :level . 1)))
   #+end_src

** 61-org-trello.el

   #+begin_src emacs-lisp :tangle inits/61-org-trello.el
   (el-get-bundle org-trello)
   (defun my/org-trello-fetch-buffer ()
     (interactive)
     (org-trello-sync-buffer t))

   (with-eval-after-load 'pretty-hydra
     (pretty-hydra-define
       org-trello-hydra
       (:separator "-"
                   :color teal
                   :foreign-key warn
                   :title (concat (all-the-icons-faicon "trello") "  Org Trello commands")
                   :quit-key "q")
       ("Install"
        (("i" org-trello-install-board-metadata "Board metadata")
         ("I" org-trello-install-key-and-token "Setup"))

        "Sync"
        (("s" my/org-trello-fetch-buffer "← Trello")
         ("S" org-trello-sync-buffer "→ Trello"))

        "Other"
        (("V" org-trello-version "Version")))))
   #+end_src

** 61-ox-hugo.el

   #+begin_src emacs-lisp :tangle inits/61-ox-hugo.el
   (el-get-bundle ox-hugo)
   (with-eval-after-load 'ox
     (require 'ox-hugo))
   #+end_src

** 61-seesaa-blog.el                                                 :unused:

   #+begin_src emacs-lisp :tangle inits/61-seesaa-blog.el
   (el-get-bundle seesaa-blog-mode) ;; for seesaa blog. dependent org-mdoe
   (my/load-config "my-seesaa-blog-config")
   #+end_src

** 62-nippou.el

   #+begin_src emacs-lisp :tangle inits/62-nippou.el
   (my/load-config "my-nippou-config")

   (defun my/org-nippou-targets ()
         (-concat (my/org-nippou-files) my/org-nippou-additional-files))

   (defun my/org-nippou-files ()
     (let* ((dir my/org-tasks-directory)
            (cmd (format "find \"%s\" -name '*.org' -or -name '*.org_archive'" dir))
            (result (shell-command-to-string cmd))
            (file-names (split-string result "\n")))
       (-remove (lambda (file-name) (string= "" file-name))
                file-names)))

   (defun my/nippou-query ()
     (interactive)
     (org-ql-search
       (my/org-nippou-targets)
       "todo:TODO,DOING,WAIT,DONE ts:on=today"
       :title "日報"
       :super-groups '((:auto-group))))
   #+end_src

** 68-my-org-commands.el

   #+begin_src emacs-lisp :tangle inits/68-my-org-commands.el
   (defun my/org-clock-toggle-display ()
     "行の後ろに掛かった作業時間を表示をしたり消したりを切り替える機能。
   Hydra から利用するために定義している。"
     (interactive)
     (if org-clock-overlays
         (org-clock-remove-overlays)
       (org-clock-display)))

   (defun my/org-todo-keyword-strings ()
     "org-todo-keywords から装飾を省いた文字列のリストを返す関数"
     (let* ((keywords (cl-rest (cl-first org-todo-keywords)))
            (without-delimiter (cl-remove-if (lambda (elm) (string= "|" elm))
                                             keywords)))
       (mapcar (lambda (element)
                 (replace-regexp-in-string "\(.+\)" "" element))
               without-delimiter)))

   (defun my/org-todo ()
     "ivy で TODO ステータスを切り替えるためのコマンド
   Hydra から利用するために定義している。"
     (interactive)
     (ivy-read "Org todo: "
               (my/org-todo-keyword-strings)
               :require-match t
               :sort nil
               :action (lambda (keyword)
                         (org-todo keyword))))

   (defun my/org-tags-view-only-todo ()
     (interactive)
     (org-tags-view t))

   (defun my/open-calendar ()
     (interactive)
     (ivy-read "Calendar: "
               my/calendar-targets
               :require-match t
               :sort nil
               :action (lambda (target)
                         (progn
                           (setq cfw:org-icalendars `(,(concat org-directory target ".org")))
                           (cfw:open-org-calendar)))))
   #+end_src

