init.org
** 69-org-mode-hydra.el

   #+begin_src emacs-lisp :tangle inits/69-org-mode-hydra.el
   (with-eval-after-load 'major-mode-hydra
     (major-mode-hydra-define org-mode (:separator "-" :quit-key "q" :title (concat (all-the-icons-fileicon "org") " Org commands"))
       ("Insert"
        (("l" org-insert-link                     "Link")
         ("T" org-insert-todo-heading             "Todo")
         ("h" org-insert-heading-respect-content  "Heading")
         ("P" org-set-property                    "Property")
         ("." org-time-stamp                      "Timestamp")
         ("!" org-time-stamp-inactive             "Timestamp(inactive)")
         ("S" org-insert-structure-template       "Snippet"))

        "Edit"
        (("a" org-archive-subtree  "Archive")
         ("r" org-refile           "Refile")
         ("Q" org-set-tags-command "Tag"))

        "View"
        (("N" org-toggle-narrow-to-subtree "Toggle Subtree")
         ("C" org-columns "Columns")
         ("D" my/org-clock-toggle-display  "Toggle Display"))

        "Task"
        (("s" org-schedule         "Schedule")
         ("d" org-deadline         "Deadline")
         ("t" my/org-todo          "Change state")
         ("c" org-toggle-checkbox  "Toggle checkbox"))

        "Clock"
        (("i" org-clock-in      "In")
         ("o" org-clock-out     "Out")
         ("E" org-set-effort    "Effort")
         ("R" org-clock-report  "Report")
         ("p" org-pomodoro      "Pomodoro"))

        "Babel"
        (("e" org-babel-confirm-evaluate "Eval")
         ("x" org-babel-tangle "Export SRC"))

        "Trello"
        (("K" org-trello-mode "On/Off" :toggle org-trello-mode)
         ("k" (if org-trello-mode
                  (org-trello-hydra/body)
                (message "org-trello-mode is not enabled")) "Menu"))

        "Agenda"
        (("," org-cycle-agenda-files "Cycle")))))

   (with-eval-after-load 'pretty-hydra
     (pretty-hydra-define
       global-org-hydra
       (:separator "-"
                   :color teal
                   :foreign-key warn
                   :title (concat (all-the-icons-fileicon "org") " Global Org commands")
                   :quit-key "q")
       ("Main"
        (("a" org-agenda "Agenda")
         ("c" counsel-org-capture "Capture")
         ("l" org-store-link "Store link")
         ("t" my/org-tags-view-only-todo "Tagged Todo"))

        "Calendar"
        (("F" org-gcal-fetch "Fetch Calendar")
         ("C" my/open-calendar "Calendar"))

        "Clock"
        (("i" org-clock-in       "In")
         ("o" org-clock-out      "Out")
         ("r" org-clock-in-last  "Restart")
         ("x" org-clock-cancel   "Cancel")
         ("j" org-clock-goto     "Goto"))

        "Search"
        (("H" org-search-view "Heading"))

        "Pomodoro"
        (("p" org-pomodoro "Pomodoro")))))
   #+end_src

** 70-esa.el

   #+begin_src emacs-lisp :tangle inits/70-esa.el
   (el-get-bundle esa)
   (my/load-config "my-esa-config")
   #+end_src

** 70-key-chord.el

   #+begin_src emacs-lisp :tangle inits/70-key-chord.el
   (el-get-bundle zk-phi/key-chord)
   (setq key-chord-two-keys-delay           0.15
         key-chord-safety-interval-backward 0.1
         key-chord-safety-interval-forward  0.15)
   (key-chord-mode 1)
   #+end_src

** 70-my-commands.el

   #+begin_src emacs-lisp :tangle inits/70-my-commands.el
   (defun my/replace-var (point mark)
     (interactive "r")
     (let* ((str (buffer-substring point mark))
            (cmd (concat "fetch-color-var '" str "'"))
            (response (shell-command-to-string cmd)))
       (delete-region point mark)
       (insert response)))

   (setq my/org-document-dir (expand-file-name "~/Documents/org/"))
   (defun my/create-org-document ()
     (interactive)
     (find-file-other-window my/org-document-dir))

   (defun my/insert-review-requested-prs-as-string ()
     (interactive)
     (let* ((cmd (concat "review-requested-prs " my/github-organization " " my/github-repository))
            (response (shell-command-to-string cmd)))
       (insert response)))
   #+end_src

** 70-scratch-log.el

   #+begin_src emacs-lisp :tangle inits/70-scratch-log.el
   (el-get-bundle mori-dev/scratch-log)

   (require 'scratch-log) ;; TODO: require 以外の方法で処理できないか?
   #+end_src

** 70-tempbuf.el

   #+begin_src emacs-lisp :tangle inits/70-tempbuf.el
   (el-get-bundle tempbuf)

   (setq my/tempbuf-ignore-files '("~/Documents/org/tasks/gtd.org"
                                   "~/Documents/org/tasks/interrupted.org"
                                   "~/Documents/org/tasks/next-actions.org"
                                   ))

   (defun my/find-file-tempbuf-hook ()
     (let ((ignore-file-names (mapcar 'expand-file-name my/tempbuf-ignore-files)))
       (unless (member (buffer-file-name) ignore-file-names)
         (turn-on-tempbuf-mode))))

   (add-hook 'find-file-hook 'my/find-file-tempbuf-hook)
   (add-hook 'dired-mode-hook 'turn-on-tempbuf-mode)
   #+end_src

** 70-w3m.el

   #+begin_src emacs-lisp :tangle inits/70-w3m.el
   (el-get-bundle emacs-w3m)
   #+end_src

** 70-yascroll.el

   #+begin_src emacs-lisp :tangle inits/70-yascroll.el
   (el-get-bundle yascroll)
   #+end_src

** 70-zoom-window.el

   #+begin_src emacs-lisp :tangle inits/70-zoom-window.el
   ;; tmux の prefix z のような動きをするやつ
   (el-get-bundle zoom-window)

   ;; キーバインドは 80-global-keybinds に書いた
   #+end_src

** 80-edit.el

   #+begin_src emacs-lisp :tangle inits/80-edit.el
   (setq indent-tabs-mode nil) ;; インデントにタブを使わない
   (save-place-mode 1)
   #+end_src

** 80-frame-cmds.el

   #+begin_src emacs-lisp :tangle inits/80-frame-cmds.el
   (el-get-bundle frame-cmds)

   (pretty-hydra-define window-control-hydra (:separator "-" :title "Window Control" :exit nil :quit-key "q")
     ("Move"
      (("h" move-frame-left  "Left")
       ("j" move-frame-down  "Down")
       ("k" move-frame-up    "Up")
       ("l" move-frame-right "Right"))

      "Resize"
      (("H" shrink-frame-horizontally "H-")
       ("J" enlarge-frame "V+")
       ("K" shrink-frame "V-")
       ("L" enlarge-frame-horizontally "H+"))))
   #+end_src

** 80-global-keybinds.el

   #+begin_src emacs-lisp :tangle inits/80-global-keybinds.el
   (if (eq window-system 'ns)
       (progn
             (setq ns-alternate-modifier (quote super)) ;; option  => super
             (setq ns-command-modifier (quote meta))))  ;; command => meta

   ;; C-h を backspace に
   (keyboard-translate ?\C-h ?\C-?)
   (global-set-key "\C-h" nil)

   ;; M-g rをstring-replaceに割り当て
   (global-set-key (kbd "M-g r") 'replace-string)

   ;; C-\ で skk が有効になるように
   (global-set-key (kbd "C-\\") 'skk-mode)

   ;; C-s で swiper を代わりに使うことにした
   (global-set-key (kbd "C-s") 'swiper)

   ;; C-x o で ace-window を起動するようにした
   (global-set-key (kbd "C-x o") 'ace-window)

   ;; Shift+矢印でwindow移動
   (windmove-default-keybindings)

   ;; undo-fu
   (global-set-key (kbd "C-/") 'undo-fu-only-undo)
   (global-set-key (kbd "C-M-/") 'undo-fu-only-redo)

   ;; ¥ ではなく \ になるように調整
   (define-key global-map [?¥] [?\\])
   (define-key global-map [?\C-¥] [?\C-\\])
   (define-key global-map [?\M-¥] [?\M-\\])
   (define-key global-map [?\C-\M-¥] [?\C-\M-\\])

   ;; multiple-cursors
   (global-set-key (kbd "C-:") 'mc/edit-lines)
   (global-set-key (kbd "C->") 'mc/mark-next-like-this)
   (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
   (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)

   ;; helm
   ;; (global-set-key (kbd "M-y") 'helm-show-kill-ring)
   (global-set-key (kbd "C-;") 'helm-for-files)
   ;; (global-set-key (kbd "M-x") 'helm-M-x)
   ;; (global-set-key (kbd "C-x b") 'helm-mini)
   ;; (global-set-key (kbd "C-x C-f") 'helm-find-files)

   ;; ivy
   (global-set-key (kbd "M-x") 'counsel-M-x)
   (global-set-key (kbd "M-y") 'counsel-yank-pop)
   (global-set-key (kbd "C-x b") 'counsel-switch-buffer)
   (global-set-key (kbd "C-x C-f") 'counsel-find-file)

   ;; zoom-window
   (global-set-key (kbd "C-x 1") 'zoom-window-zoom)

   ;; neotree
   (global-set-key [f8] 'neotree-toggle)

   ;; org-mode
   (setq my/org-mode-prefix-key "C-c o ")
   (global-set-key (kbd (concat my/org-mode-prefix-key "a")) 'org-agenda)
   (global-set-key (kbd (concat my/org-mode-prefix-key "c")) 'org-capture)
   (global-set-key (kbd (concat my/org-mode-prefix-key "l")) 'org-store-link)

   ;; with keychord
   (key-chord-define-global "jk" 'pretty-hydra-usefull-commands/body)

   ;; Don't ask yes or no.
   (defalias 'yes-or-no-p 'y-or-n-p)
   #+end_src

** 80-undo-fu.el

   #+begin_src emacs-lisp :tangle inits/80-undo-fu.el
   (el-get-bundle undo-fu)
   #+end_src

** 80-wakatime.el

   #+begin_src emacs-lisp :tangle inits/80-wakatime.el
   (el-get-bundle wakatime-mode)
   (my/load-config "my-wakatime-config")
   (global-wakatime-mode 1)
   #+end_src

