init.org
** 81-hydra.el

   #+begin_src emacs-lisp :tangle inits/81-hydra.el
   (el-get-bundle hydra)

   ;; hydra-posframe
   ;; https://github.com/Ladicle/hydra-posframe
   ;; 画面真ん中に表示されて便利
   (el-get-bundle hydra-posframe)
   (add-hook 'after-init-hook 'hydra-posframe-enable)

   (el-get-bundle jerrypnz/major-mode-hydra.el)

   (pretty-hydra-define el-get-hydra (:separator "-" :title "el-get" :foreign-key warn :quit-key "q" :exit t)
     ("Install"
      (("i" el-get-install   "Install")
       ("I" el-get-reinstall "Re-install")
       ("D" el-get-remove    "Uninstall"))

      "Update"
      (("s" el-get-self-update  "Self Update")
       ("u" el-get-update       "Update")
       ("A" el-get-update-all   "Update All")
       ("r" el-get-reload       "Reload"))

      "Recipe"
      (("f" el-get-find-recipe-file  "Find recipe"))

      "Lock"
      (("C" el-get-lock-checkout  "Checkout")
       ("U" el-get-lock-unlock    "Unlock"))))

   (pretty-hydra-define
     toggle-hydra
     (:separator "-"
                 :title (concat (all-the-icons-faicon "toggle-on") " Toggle Switches")
                 :foreign-key warn
                 :quit-key "q"
                 :exit t)
     ("View"
      (("z" zoom-mode                 "zoom-mode"      :toggle zoom-mode)
       ("Z" toggle-frame-fullscreen   "Fullscreen"     :toggle (frame-parameter nil 'fullscreen))
       ("b" display-battery-mode      "Battery"        :toggle display-battery-mode)
       ("L" display-line-numbers-mode "Line Number"    :toggle display-line-numbers-mode)
       ("N" neotree-toggle            "Neotree"        :toggle (if (fboundp 'neo-global--window-exists-p) (neo-global--window-exists-p) nil)))

      "Behavior"
      (("S" my/notify-slack-toggle    "Notify Slack"   :toggle my/notify-slack-enable-p)
       ("v" my/toggle-view-mode       "Readonly"       :toggle view-mode)
       ("E" toggle-debug-on-error     "Debug on error" :toggle debug-on-error))))

   (pretty-hydra-define
     subtools-hydra
     (:separator "-"
                 :color teal
                 :foreign-key warn
                 :title (concat (all-the-icons-material "build") " Sub tools")
                 :quit-key "q"
                 :exit t)
     ("Translation"
      (("t" google-translate-at-point "EN => JP")
       ("T" google-translate-at-point-reverse "JP => EN"))

      "Describe"
      (("b" counsel-descbinds "Keybind")
       ("f" counsel-describe-function "Function")
       ("v" counsel-describe-variable "Variable")
       ("m" describe-minor-mode "Minor mode"))

      ;; ("P"   my/open-review-requested-pr "Open Requested PR")
      "Other"
      (("@"   all-the-icons-hydra/body "List icons"))))

   (pretty-hydra-define text-scale-hydra (:separator "-" :title (concat (all-the-icons-material "text_fields") " Text Scale") :exit nil :quit-key "q")
     ("Scale"
      (("+" text-scale-increase "Increase")
       ("-" text-scale-decrease "Decrease")
       ("0" text-scale-adjust   "Adjust"))))

   (pretty-hydra-define pretty-hydra-usefull-commands (:separator "-" :color teal :foreign-key warn :title (concat (all-the-icons-material "build") " Usefull commands") :quit-key "q")
     ("File"
      (("p" projectile-hydra/body "Projectile")
       ("f" counsel-find-file     "Find File")
       ("d" counsel-find-dir      "Find Dir")
       ("r" counsel-recentf       "Recentf")
       ("l" counsel-locate        "Locate")
       ("A" counsel-osx-app       "macOS App"))

      "Edit"
      (("a" align-regexp "Align Regexp")
       (";" comment-dwim "Comment"))

      "Code"
      (("G" counsel-projectile-ag       "Grep")
       ("j" dumb-jump-pretty-hydra/body "Dumb jump")
       ("g" avy-hydra/body)
       ("i" counsel-imenu               "imenu")
       ("y" yasnippet-hydra/body        "Yasnippet")
       ("B" browse-at-remote            "Browse")
       ("m" magit-status                "Magit"))

      "View"
      (("D" delete-other-windows      "Only This Win")
       ("W" window-control-hydra/body "Window Control")
       ("+" text-scale-hydra/body     "Text Scale")
       ("w" ace-swap-window           "Swap Window"))

      "Tool"
      (("SPC" major-mode-hydra              "Hydra(Major)")
       ("s"   toggle-hydra/body             "Toggle switches")
       ("c"   counsel-org-capture           "Capture")
       ("o"   global-org-hydra/body         "Org")
       ("e"   el-get-hydra/body             "el-get")
       ("/"   google-this-pretty-hydra/body "Google")
       ("t"   subtools-hydra/body           "Sub Tools"))))
   #+end_src

** 82-ivy.el

   #+begin_src emacs-lisp :tangle inits/82-ivy.el
   (el-get-bundle abo-abo/swiper) ;; ivy, swiper, counsel が同時に入って来る

   (when (require 'ivy nil t)
     ;; M-o を ivy-dispatching-done-hydra に割り当てる．
     (require 'ivy-hydra)

     ;; `ivy-switch-buffer' (C-x b) のリストに recent files と bookmark を含める．
     (setq ivy-use-virtual-buffers t)

     ;; ミニバッファでコマンド発行を認める
     (when (setq enable-recursive-minibuffers t)
       (minibuffer-depth-indicate-mode 1)) ;; 何回層入ったかプロンプトに表示．

     ;; ESC連打でミニバッファを閉じる
     (define-key ivy-minibuffer-map (kbd "<escape>") 'minibuffer-keyboard-quit)

     ;; (index/総数) 表示で何番目の候補かわかりやすくする
     (setq ivy-count-format "(%d/%d) ")

     ;; アクティベート
     (ivy-mode 1))

   (counsel-mode 1)

   ;; posframe を使って中央表示
   (el-get-bundle ivy-posframe)
   (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center)))
   (ivy-posframe-mode 1)

   (el-get-bundle ivy-rich)

   ;; https://ladicle.com/post/config/#ivy
   ;; に書かれている関数を丸コピしてきた
   (defun ivy-rich-file-icon (candidate)
     "Display file icons in `ivy-rich'."
     (when (display-graphic-p)
       (let ((icon (if (file-directory-p candidate)
                       (cond
                        ((and (fboundp 'tramp-tramp-file-p)
                              (tramp-tramp-file-p default-directory))
                         (all-the-icons-octicon "file-directory"))
                        ((file-symlink-p candidate)
                         (all-the-icons-octicon "file-symlink-directory"))
                        ((all-the-icons-dir-is-submodule candidate)
                         (all-the-icons-octicon "file-submodule"))
                        ((file-exists-p (format "%s/.git" candidate))
                         (all-the-icons-octicon "repo"))
                        (t (let ((matcher (all-the-icons-match-to-alist candidate all-the-icons-dir-icon-alist)))
                             (apply (car matcher) (list (cadr matcher))))))
                     (all-the-icons-icon-for-file candidate))))
         (unless (symbolp icon)
           (propertize icon
                       'face `(
                               :height 1.1
                               :family ,(all-the-icons-icon-family icon)
                               ))))))

   ;; https://github.com/Yevgnen/ivy-rich#1312-add-icons-for-ivy-switch-buffer
   (defun ivy-rich-switch-buffer-icon (candidate)
     (with-current-buffer
         (get-buffer candidate)
       (let ((icon (all-the-icons-icon-for-mode major-mode)))
         (if (symbolp icon)
             (all-the-icons-icon-for-mode 'fundamental-mode)
           icon))))

   ;; yank-pop の区切りを変更。ちょっと長めにしている
   (setq counsel-yank-pop-separator "\n--------------------\n")

   (setq ivy-rich-display-transformers-list
         '(ivy-switch-buffer
           (:columns
            ((ivy-rich-switch-buffer-icon :width 2)
             (ivy-rich-candidate (:width 30))
             (ivy-rich-switch-buffer-size (:width 7))
             (ivy-rich-switch-buffer-indicators (:width 4 :face error :align right))
             (ivy-rich-switch-buffer-major-mode (:width 12 :face warning))
             (ivy-rich-switch-buffer-project (:width 15 :face success))
             (ivy-rich-switch-buffer-path (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path x (ivy-rich-minibuffer-width 0.3))))))
            :predicate
            (lambda (cand) (get-buffer cand)))
           counsel-M-x
           (:columns
            ((counsel-M-x-transformer (:width 40))  ; thr original transformer
             (ivy-rich-counsel-function-docstring (:face font-lock-doc-face))))  ; return the docstring of the command
           counsel-find-file
           (:columns
            ((ivy-rich-file-icon)
             (ivy-rich-candidate)))
           counsel-recentf
           (:columns
            ((ivy-rich-file-icon)
             (ivy-rich-candidate (:width 110))))
           ))

   (ivy-rich-mode 1)

   ;; https://www.yewton.net/2020/05/21/migemo-ivy/
   ;; 関数名などは書き換えてる
   (defun my/ivy-migemo-re-builder (str)
     (let* ((sep " \\|\\^\\|\\.\\|\\*")
            (splitted (--map (s-join "" it)
                             (--partition-by (s-matches-p " \\|\\^\\|\\.\\|\\*" it)
                                             (s-split "" str t)))))
       (s-join "" (--map (cond ((s-equals? it " ") ".*?")
                               ((s-matches? sep it) it)
                               (t (migemo-get-pattern it)))
                         splitted))))

   (setq ivy-re-builders-alist '((t . ivy--regex-plus)
                                 (swiper . my/ivy-migemo-re-builder)))
   #+end_src

** 83-counsel-osx-app.el

   #+begin_src emacs-lisp :tangle inits/83-counsel-osx-app.el
   (el-get-bundle counsel-osx-app)
   #+end_src

** 83-prescient.el

   #+begin_src emacs-lisp :tangle inits/83-prescient.el
   (el-get-bundle raxod502/prescient.el)
   (ivy-prescient-mode 1)
   (setq prescient-sort-length-enable nil)
   #+end_src

** 90-font.el

   #+begin_src emacs-lisp :tangle inits/90-font.el
   (let* ((size 14)
          (asciifont "Ricty Diminished")      ; ASCII fonts
          (jpfont "Ricty Diminished")         ; Japanese fonts
          (h (* size 10))
          (fontspec (font-spec :family asciifont))
          (jp-fontspec (font-spec :family jpfont)))
     (set-face-attribute 'default nil :family asciifont :height h)
     (set-fontset-font nil 'japanese-jisx0213.2004-1 jp-fontspec)
     (set-fontset-font nil 'japanese-jisx0213-2 jp-fontspec)
     (set-fontset-font nil 'katakana-jisx0201 jp-fontspec)
     (set-fontset-font nil '(#x0080 . #x024F) fontspec)
     (set-fontset-font nil '(#x0370 . #x03FF) fontspec))
   #+end_src

