init.org
** 90-fullscreen.el

   #+begin_src emacs-lisp :tangle inits/90-fullscreen.el
   ;; Mac の場合にフルスクリーンにする
   ;; 2020-01-08 yabai WM を導入したのでフルスクリーンじゃない方がよくなったのでコメントアウト
   ;; (if (or (eq window-system 'ns) (eq window-system 'mac))
   ;;     (add-hook 'window-setup-hook
   ;;               (lambda ()
   ;;                 (set-frame-parameter nil 'fullscreen 'fullboth))))

   ;; X Window system の場合にフルスクリーンにする
   (if (eq window-system 'x)
       (add-hook 'window-setup-hook
                 (lambda ()
                   (set-frame-parameter nil 'fullscreen 'fullboth)
                   (set-frame-position nil 0 0))))
   #+end_src

** 90-mode-line.el

   #+begin_src emacs-lisp :tangle inits/90-mode-line.el
   ;; 一部のモードでは mode-line を表示しないようにする
   (el-get-bundle hlissner/emacs-hide-mode-line)
   (add-hook 'neotree-mode-hook #'hide-mode-line-mode)

   ;; 日時を modeline で表示
   (display-time-mode 1)

   ;; (el-get-bundle smart-mode-line)
   ;; (defvar sml/no-confirm-load-theme t)
   ;; (defvar sml/theme 'dark)
   ;; (sml/setup)

   ;; major-mode
   ;; (add-hook 'emacs-lisp-mode-hook (lambda () (setq mode-name (all-the-icons-fileicon "elisp"))))
   ;; (add-hook 'enh-ruby-mode-hook (lambda () (setq mode-name (concat "e" (all-the-icons-alltheicon "ruby-alt")))))
   ;; (add-hook 'ruby-mode-hook (lambda () (setq mode-name (all-the-icons-alltheicon "ruby-alt"))))
   ;; (add-hook 'vue-mode-hook (lambda ()
   ;;                            (make-local-variable 'mmm-submode-mode-line-format)
   ;;                            (setq mmm-submode-mode-line-format "~M:~m")
   ;;                            (make-local-variable 'mmm-buffer-mode-display-name)
   ;;                            (setq mmm-buffer-mode-display-name "V")))
   ;; (add-hook 'js-mode-hook (lambda () (setq mode-name "")))
   ;; (add-hook 'pug-mode-hook (lambda () (setq mode-name (all-the-icons-fileicon "pug"))))
   ;; (add-hook 'css-mode-hook (lambda () (setq mode-name (all-the-icons-faicon "css3"))))
   ;; (add-hook 'twittering-mode-hook (lambda () (setq mode-name (all-the-icons-faicon "twitter-square"))))
   ;; (add-hook 'org-mode-hook (lambda () (setq mode-name (all-the-icons-fileicon "org"))))

   (el-get-bundle diminish)
   (require 'diminish)

   (defmacro my/diminish (file mode &optional new-name)
     "https://github.com/larstvei/dot-emacs/blob/master/init.org"
     `(with-eval-after-load ,file
        (diminish ,mode ,new-name)))

   ;; minor-mode
   ;; (my/diminish "helm" 'helm-mode ":helmet-with-cross:")
   ;; (my/diminish "git-gutter" 'git-gutter-mode (all-the-icons-octicon "git-compare"))
   ;; (my/diminish "yasnippet" 'yas-minor-mode " Ys")
   ;; (my/diminish "whitespace" 'whitespace-mode "◽")
   ;; (my/diminish "whitespace" 'global-whitespace-mode "◽")
   ;; (my/diminish "tempbuf" 'tempbuf-mode "")
   ;; (my/diminish "flycheck" 'flycheck-mode "")
   ;; (my/diminish "zoom" 'zoom-mode "")
   ;; (my/diminish "rainbow" 'rainbow-mode "🌈")
   ;; (my/diminish "projectile-rails" 'projectile-rails-mode "🛤")
   ;; (my/diminish "company" 'company-mode "")
   ;; (my/diminish "ElDoc" 'eldoc-mode "")
   #+end_src

** 90-theme.el

   #+begin_src emacs-lisp :tangle inits/90-theme.el
   (el-get-bundle alloy-d/color-theme-molokai)
   (add-to-list 'custom-theme-load-path (expand-file-name "~/.emacs.d/el-get/color-theme-molokai"))
   (load-theme 'molokai t)
   #+end_src

** 90-twmode.el

   #+begin_src emacs-lisp :tangle inits/90-twmode.el
   (el-get-bundle twittering-mode)

   (setq twittering-username "mugijiru")
   (setq twittering-jojo-mode t)
   (setq twittering-timer-interval 60)
   ;(setq twittering-auth-method 'xauth)
   (setq twittering-auth-method 'oauth)
   (setq twittering-update-status-function 'twittering-update-status-from-minibuffer)
   (setq twittering-status-format "%i %S(%s)%p, %@:\n%FILL{  %T // from %f%L%r%R}\n ")
   (setq twittering-retweet-format "RT @%s %t")
   (setq twittering-display-remaining t)
   (let ((km twittering-mode-map))
     (define-key km (kbd "SPC") 'scroll-up)
     (define-key km (kbd "b") 'scroll-down)
     (define-key km (kbd "g") 'beginning-of-buffer)
     (define-key km (kbd "G") 'end-of-buffer)
     (define-key km (kbd "<") 'beginning-of-buffer)
     (define-key km (kbd ">") 'end-of-buffer)
     (define-key km (kbd "R") 'twittering-current-timeline)
     (define-key km (kbd "F") 'twittering-favorite)
     (define-key km (kbd "\C-cfd") 'twittering-unfavorite)
     (define-key km (kbd "\C-c[") 'twittering-follow)
     (define-key km (kbd "\C-c]") 'twittering-unfollow)
     nil)
   #+end_src

** 91-doom-modeline.el

   #+begin_src emacs-lisp :tangle inits/91-doom-modeline.el
   (el-get-bundle doom-modeline)
   (doom-modeline-mode 1)
   (setq doom-modeline-vcs-max-length 30)
   (display-battery-mode 1)
   #+end_src

** 92-dashboard.el

   #+begin_src emacs-lisp :tangle inits/92-dashboard.el
   (el-get-bundle dashboard)

   ;; 表示するアイコンをロゴに変更
   (setq dashboard-startup-banner 'logo)

   ;; 表示する情報の設定
   (setq dashboard-items '((recents  . 5)
                           ;; (bookmarks . 5) ;; bookmarks は使ってない
                           (projects . 5)
                           (agenda . 5)
                           ;; (registers . 5) ;; registers は使ってない
                           ))

   ;; 各セクションのタイトル部の先頭にアイコンを表示
   (setq dashboard-set-heading-icons t)

   ;; 各ファイルの先頭にアイコンを表示
   (setq dashboard-set-file-icons t)
   (dashboard-setup-startup-hook)
   #+end_src

** 99-custom-file.el

   #+begin_src emacs-lisp :tangle inits/99-custom-file.el
   (setq custom-file (expand-file-name "~/.emacs.d/custom.el"))
   (load custom-file)
   #+end_src

** 99-server.el

   #+begin_src emacs-lisp :tangle inits/99-server.el
   ;; サーバとして起動
   ;; Firefox から org-capture を動かすのに必要
   (require 'server)
   (unless (server-running-p)
     (server-start))
   #+end_src
* Footnotes
* COMMENT Local Variables                          :ARCHIVE:
# Local Variables:
# eval: (org-hugo-auto-export-mode)
# End:
